/* Напишіть цикл, який перетворить масив тварин на масив чудових тварин.​
 
Тобто із масиву «Кіт», «Собака», «Лемур», «Мавпа» треба отримати
«Кіт – чудова тварина», «Собака – чудова тварина» і т д.​
​
 
Реалізуйте цю задачу за допомогою циклу for,
оновлені тварини мають зберегтись в цьому ж масиві
(тобто не створюйте новий масив на базі старого, а запишіть
нові значення в уже існуючий масив)​*/
 
let array =["Кіт", "Собака", "Лемур", "Мавпа"];
 
for (let i=0;i<array.length;i++){
   array[i]=array[i]+" – чудова тварина";
}
 
console.log(array.toString());